CSI API ETABS v1
cFile.GetFilePath Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetFilePath(
	ref string FilePath
)
Function GetFilePath (
	ByRef FilePath As String
) As Integer
Dim instance As cFile
Dim FilePath As String
Dim returnValue As Integer
returnValue = instance.GetFilePath(FilePath)
int GetFilePath(
	String^% FilePath
)
abstract GetFilePath :
        FilePath : string byref -> int
Parameters
FilePath
Type: System.String
Return Value
Type: Int32
See Also
Reference
cFile Interface
ETABSv1 Namespace